app/app/views/users/show.html.erb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
<h1><%= usr.user_name %></h1><br>
<h4><%= @user.profile.first_name %> <%= @user.profile.last_name %></h4><br>