app/views/users/show.html.erb

</div>
<h4><%= @user.profile.first_name %> <%= @user.profile.last_name %></h4><br>
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 2]]