app/controllers/pages_controller.rb

    def home
    	@messages = Message.all
---
SELECT "messages".* FROM "messages"