app/controllers/profiles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def new
		# Form for users to make their profile
		@user=User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
INSERT INTO "profiles" ("user_name", "first_name", "last_name", "facebook_page", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "user_id" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["user_id", nil], ["updated_at", "2015-12-14 10:25:19.742721"], ["id", 8]]
---
	def create
		@user = User.find(params[:user_id])
		@profile = @user.build_profile(profile_params)
		if @profile.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
	def edit
		@user=User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "profiles" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar_updated_at", "2015-12-19 09:42:14.862947"], ["avatar_file_name", "Brainiac-losh.jpg"], ["updated_at", "2015-12-19 09:42:15.033476"], ["id", 1]]
---
	def update
		@user=User.find(params[:user_id])
		@profile=@user.profile
			if @profile.update_attributes(profile_params)